package q10_3;

/*
    一只青蛙一次可以跳上1级台阶，也可以跳上2级。
    求该青蛙跳上一个n级的台阶总共有多少种跳法（先后次序不同算不同的结果）。

*/
public class Solution {
    private static int[] FibonacciMap = new int[]{
            0, 1, 2, 3, 5, 8,
            13, 21, 34, 55, 89, 144, 233, 377, 610, 987, 1597,
            2584, 4181, 6765, 10946, 17711, 28657, 46368, 75025,
            121393, 196418, 317811, 514229, 832040, 1346269, 2178309,
            3524578, 5702887, 9227465, 14930352, 24157817, 39088169,
            63245986, 102334155, 165580141
    };

    public int JumpFloor(int target) {
        return FibonacciMap[target];
    }
}